# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge on One-to-Many and Many-to-many relationships!

## Objectives

You will be able to:
- Query data including Many-to-Many relationships
- Write queries that make use of Join Tables

## One-to-Many and Many-to-Many Joins
<img src='Database-Schema.png' width=550>

## Employees and their Office (a One-to-One join)

Return a list of all of the employees with their first name, last name and the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [7]:
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
curr= conn.cursor()

In [14]:
#Your code here
curr.execute('''SELECT firstName, lastName, city, state 
                FROM employees 
                JOIN offices
                USING (officecode)
                ORDER BY firstName, lastName''')

df = pd.DataFrame(curr.fetchall())
df.columns = [i[0] for i in curr.description]
df.head(20)

   firstName   lastName           city       state
0       Andy     Fixter         Sydney
1    Anthony        Bow  San Francisco          CA
2      Barry      Jones         London
3      Diane     Murphy  San Francisco          CA
4   Foon Yue      Tseng            NYC          NY
5     George     Vanauf            NYC          NY
6     Gerard     Bondur          Paris
7     Gerard  Hernandez          Paris
8       Jeff   Firrelli  San Francisco          CA
9      Julie   Firrelli         Boston          MA
10     Larry       Bott         London
11    Leslie   Jennings  San Francisco          CA
12    Leslie   Thompson  San Francisco          CA
13      Loui     Bondur          Paris
14      Mami      Nishi          Tokyo  Chiyoda-Ku
15    Martin     Gerard          Paris
16      Mary  Patterson  San Francisco          CA
17    Pamela   Castillo          Paris
18     Peter      Marsh         Sydney
19     Steve  Patterson         Boston          MA

## Customers and their Orders (a One-to-Many join)

Return a list of all of the customers. For each customer return a record for each of their order numbers, order dates and statuses.

In [17]:
# Your code here
curr.execute('''SELECT customername, ordernumber, orderdate, status
                FROM customers 
                JOIN orders
                USING (customernumber)
                ORDER BY orderdate D''')

df = pd.DataFrame(curr.fetchall())
df.columns = [i[0] for i in curr.description]
df.head(20)

                    customerName orderNumber   orderDate   status
0   Online Diecast Creations Co.       10100  2003-01-06  Shipped
1           Blauer See Auto, Co.       10101  2003-01-09  Shipped
2                Vitachrome Inc.       10102  2003-01-10  Shipped
3             Baane Mini Imports       10103  2003-01-29  Shipped
4         Euro+ Shopping Channel       10104  2003-01-31  Shipped
5       Danish Wholesale Imports       10105  2003-02-11  Shipped
6                  Rovelli Gifts       10106  2003-02-17  Shipped
7              Land of Toys Inc.       10107  2003-02-24  Shipped
8                Cruz & Sons Co.       10108  2003-03-03  Shipped
9   Motor Mint Distributors Inc.       10109  2003-03-10  Shipped
10                AV Stores, Co.       10110  2003-03-18  Shipped
11      Volvo Model Replicas, Co       10112  2003-03-24  Shipped
12               Mini Wheels Co.       10111  2003-03-25  Shipped
13  Mini Gifts Distributors Ltd.       10113  2003-03-26  Shipped
14     La Corne D'abondance, Co.       10114  2003-04-01  Shipped
15          Classic Legends Inc.       10115  2003-04-04  Shipped
16                  Royale Belge       10116  2003-04-11  Shipped
17       Dragon Souveniers, Ltd.       10117  2003-04-16  Shipped
18            Enaco Distributors       10118  2003-04-21  Shipped
19         Salzburg Collectables       10119  2003-04-28  Shipped

## Orders and their Order Details (another One-to-Many join)

Return a list of orders. For each order return a record for each order detail within the order.

In [3]:
# Your code here

## Orders, Order details and Product Details (a Many-to-Many Join)

Return a list of the orders with the the order information, and all the product information for each product in the order.

In [4]:
# Your code here

## Summary

In this lab, you practiced your knowledge on One-to-Many and Many-to-many relationships!